#N1. .split() მეთოდი

#რისთვის ვიყენებთ:
#ეს მეთოდი გამოიყენება სტრიქონის (string) დასაჭრელად და მის სიად (list) გადასაქცევად.
#ის ტექსტს ყოფს გარკვეული სიმბოლოს (დელიმიტერის) მიხედვით. 
#თუ ფრჩხილებში არაფერს ჩავწერთ, ის ავტომატურად "სპეისების" მიხედვით დაჭრის ტექსტს.

#მაგალითი 1: ტექსტის დაყოფა სიტყვებად (სპეისით)
sentence = "პითონი არის ძალიან მაგარი"
words = sentence.split() 
#შედეგი: ['პითონი', 'არის', 'ძალიან', 'მაგარი']

#მაგალითი 2: ტექსტის დაყოფა მძიმის მიხედვით
data = "ვაშლი,მსხალი,ატამი,ალუბალი"
fruits = data.split(",") 
#შედეგი: ['ვაშლი', 'მსხალი', 'ატამი', 'ალუბალი']

#N2. .join() მეთოდი

#რისთვის ვიყენებთ:
#ეს მეთოდი გამოიყენება სიის (list) ელემენტების გასაერთიანებლად ერთ მთლიან სტრიქონად.
#მუშაობის პრინციპი ასეთია: "დამაკავშირებელი_სიმბოლო".join(სია)
#ის თითოეულ ელემენტს შორის ჩასვამს თქვენ მიერ მითითებულ სიმბოლოს.

#მაგალითი 1: სიის გაერთიანება ერთ წინადადებად
word_list = ["მე", "ვსწავლობ", "პროგრამირებას"]
sentence = " ".join(word_list) 
#შედეგი: "მე ვსწავლობ პროგრამირებას"

#მაგალითი 2: თარიღის ფორმატირება ტირეებით
date_parts = ["2026", "05", "06"]
formatted_date = "-".join(date_parts)
#შედეგი: "2026-05-06

# .split(): String --> List (ჭრის ტექსტს ნაჭრებად).
# .join(): List --> String (წებავს ნაჭრებს ერთ ტექსტად).


#codewars.
# 1. რიგის პირველი წევრის პოვნა
#პირველ რიგში, უნდა გავიგოთ, რა არის n-ური რიგის პირველი წევრი.
#დავაკვირდეთ, რამდენი კენტი რიცხვია გამოყენებული n-ურ რიგამდე.
#1 რიგამდე არის 0 რიცხვი.
#2 რიგამდე არის 1 რიცხვი.
#3 რიგამდე არის 1+2=3 რიცხვი.
#n-ურ რიგამდე სულ არის 1+2+3+...+(n−1) რიცხვი.
# მე-n რიგში გვაქვს n რაოდენობის წევრი, სადაც თითოეულ წევრს შორის სხვაობა d=2-ია.
# ამრიგად, დამტკიცდა, რომ ნებისმიერი n-ური რიგის კენტი რიცხვების ჯამი ყოველთვის n3-ის ტოლია.
# მაგალითად, მე-3 რიგისთვის: 33=27.
# სურათზეც ვხედავთ: 7+9+11=27. ყველაფერი ზუსტია!